Model: "functional_1"
________________________________________________________________________________________________________________________________
Layer (type)                              Output Shape                Param #        Connected to                               
================================================================================================================================
word_context_input (InputLayer)           [(None, 25, 768)]           0                                                         
________________________________________________________________________________________________________________________________
word_question_input (InputLayer)          [(None, 25, 768)]           0                                                         
________________________________________________________________________________________________________________________________
CHighway0 (TimeDistributed)               (None, 25, 768)             1181184        word_context_input[0][0]                   
________________________________________________________________________________________________________________________________
QHighway0 (TimeDistributed)               (None, 25, 768)             1181184        word_question_input[0][0]                  
________________________________________________________________________________________________________________________________
CHighway1 (TimeDistributed)               (None, 25, 768)             1181184        CHighway0[0][0]                            
________________________________________________________________________________________________________________________________
QHighway1 (TimeDistributed)               (None, 25, 768)             1181184        QHighway0[0][0]                            
________________________________________________________________________________________________________________________________
BiRNNEncoder (Bidirectional)              (None, 25, 1536)            9443328        CHighway1[0][0]                            
                                                                                     QHighway1[0][0]                            
________________________________________________________________________________________________________________________________
SimilarityLayer (Similarity)              (None, 25, 25)              4609           BiRNNEncoder[0][0]                         
                                                                                     BiRNNEncoder[1][0]                         
________________________________________________________________________________________________________________________________
C2QAttention (C2QAttention)               (None, 25, 1536)            0              SimilarityLayer[0][0]                      
                                                                                     BiRNNEncoder[1][0]                         
________________________________________________________________________________________________________________________________
Q2CAttention (Q2CAttention)               (None, 25, 1536)            0              SimilarityLayer[0][0]                      
                                                                                     BiRNNEncoder[0][0]                         
________________________________________________________________________________________________________________________________
MergedContext (MergedContext)             (None, 25, 6144)            0              BiRNNEncoder[0][0]                         
                                                                                     C2QAttention[0][0]                         
                                                                                     Q2CAttention[0][0]                         
________________________________________________________________________________________________________________________________
BiRNNDecoder1 (Bidirectional)             (None, 25, 1536)            42473472       MergedContext[0][0]                        
________________________________________________________________________________________________________________________________
SpanBegin (SpanBegin)                     (None, 25)                  7681           MergedContext[0][0]                        
                                                                                     BiRNNDecoder1[0][0]                        
________________________________________________________________________________________________________________________________
SpanEnd (SpanEnd)                         (None, 25)                  70792705       BiRNNEncoder[0][0]                         
                                                                                     MergedContext[0][0]                        
                                                                                     BiRNNDecoder1[0][0]                        
                                                                                     SpanBegin[0][0]                            
________________________________________________________________________________________________________________________________
CombineOutputs (Combine)                  (None, 2, 25)               0              SpanBegin[0][0]                            
                                                                                     SpanEnd[0][0]                              
================================================================================================================================
Total params: 125,084,163
Trainable params: 125,084,163
Non-trainable params: 0
________________________________________________________________________________________________________________________________
Epoch 1/10
1369/1369 [==============================] - 344s 251ms/step - loss: 1.0484 - accuracy: 0.7963 - val_loss: 0.0626 - val_accuracy: 0.9811
Epoch 2/10
1369/1369 [==============================] - 335s 244ms/step - loss: 0.0522 - accuracy: 0.9874 - val_loss: 0.0463 - val_accuracy: 0.9900
Epoch 3/10
1369/1369 [==============================] - 334s 244ms/step - loss: 0.0450 - accuracy: 0.9911 - val_loss: 0.0430 - val_accuracy: 0.9918
Epoch 4/10
1369/1369 [==============================] - 334s 244ms/step - loss: 0.0429 - accuracy: 0.9919 - val_loss: 0.0417 - val_accuracy: 0.9924
Epoch 5/10
1369/1369 [==============================] - 334s 244ms/step - loss: 0.0417 - accuracy: 0.9922 - val_loss: 0.0410 - val_accuracy: 0.9931
Epoch 6/10
1369/1369 [==============================] - 334s 244ms/step - loss: 0.0409 - accuracy: 0.9925 - val_loss: 0.0397 - val_accuracy: 0.9925
Epoch 7/10
1369/1369 [==============================] - 334s 244ms/step - loss: 0.0401 - accuracy: 0.9925 - val_loss: 0.0392 - val_accuracy: 0.9930
Epoch 8/10
1369/1369 [==============================] - 334s 244ms/step - loss: 0.0394 - accuracy: 0.9926 - val_loss: 0.0389 - val_accuracy: 0.9913
