Model: "functional_1"
________________________________________________________________________________________________________________________________
Layer (type)                              Output Shape                Param #        Connected to                               
================================================================================================================================
char_context_input (InputLayer)           [(None, 100, 20)]           0                                                         
________________________________________________________________________________________________________________________________
char_question_input (InputLayer)          [(None, 100, 20)]           0                                                         
________________________________________________________________________________________________________________________________
embedding_1 (Embedding)                   (None, 100, 20, 10)         50000          char_context_input[0][0]                   
                                                                                     char_question_input[0][0]                  
________________________________________________________________________________________________________________________________
Conv1D_C_10_3 (Conv1D)                    (None, 100, 18, 10)         310            embedding_1[0][0]                          
________________________________________________________________________________________________________________________________
Conv1D_C_10_4 (Conv1D)                    (None, 100, 17, 10)         410            embedding_1[0][0]                          
________________________________________________________________________________________________________________________________
Conv1D_C_10_5 (Conv1D)                    (None, 100, 16, 10)         510            embedding_1[0][0]                          
________________________________________________________________________________________________________________________________
Conv1D_Q_10_3 (Conv1D)                    (None, 100, 18, 10)         310            embedding_1[1][0]                          
________________________________________________________________________________________________________________________________
Conv1D_Q_10_4 (Conv1D)                    (None, 100, 17, 10)         410            embedding_1[1][0]                          
________________________________________________________________________________________________________________________________
Conv1D_Q_10_5 (Conv1D)                    (None, 100, 16, 10)         510            embedding_1[1][0]                          
________________________________________________________________________________________________________________________________
MaxPoolingOverTime_C_10_3 (MaxPooling2D)  (None, 100, 1, 10)          0              Conv1D_C_10_3[0][0]                        
________________________________________________________________________________________________________________________________
MaxPoolingOverTime_C_10_4 (MaxPooling2D)  (None, 100, 1, 10)          0              Conv1D_C_10_4[0][0]                        
________________________________________________________________________________________________________________________________
MaxPoolingOverTime_C_10_5 (MaxPooling2D)  (None, 100, 1, 10)          0              Conv1D_C_10_5[0][0]                        
________________________________________________________________________________________________________________________________
MaxPoolingOverTime_Q_10_3 (MaxPooling2D)  (None, 100, 1, 10)          0              Conv1D_Q_10_3[0][0]                        
________________________________________________________________________________________________________________________________
MaxPoolingOverTime_Q_10_4 (MaxPooling2D)  (None, 100, 1, 10)          0              Conv1D_Q_10_4[0][0]                        
________________________________________________________________________________________________________________________________
MaxPoolingOverTime_Q_10_5 (MaxPooling2D)  (None, 100, 1, 10)          0              Conv1D_Q_10_5[0][0]                        
________________________________________________________________________________________________________________________________
word_context_input (InputLayer)           [(None, 100)]               0                                                         
________________________________________________________________________________________________________________________________
concatenate (Concatenate)                 (None, 100, 1, 30)          0              MaxPoolingOverTime_C_10_3[0][0]            
                                                                                     MaxPoolingOverTime_C_10_4[0][0]            
                                                                                     MaxPoolingOverTime_C_10_5[0][0]            
________________________________________________________________________________________________________________________________
word_question_input (InputLayer)          [(None, 100)]               0                                                         
________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)               (None, 100, 1, 30)          0              MaxPoolingOverTime_Q_10_3[0][0]            
                                                                                     MaxPoolingOverTime_Q_10_4[0][0]            
                                                                                     MaxPoolingOverTime_Q_10_5[0][0]            
________________________________________________________________________________________________________________________________
embedding (Embedding)                     (None, 100, 100)            12334300       word_context_input[0][0]                   
                                                                                     word_question_input[0][0]                  
________________________________________________________________________________________________________________________________
tf_op_layer_Squeeze (TensorFlowOpLayer)   [(None, 100, 30)]           0              concatenate[0][0]                          
________________________________________________________________________________________________________________________________
tf_op_layer_Squeeze_1 (TensorFlowOpLayer) [(None, 100, 30)]           0              concatenate_1[0][0]                        
________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)               (None, 100, 130)            0              embedding[0][0]                            
                                                                                     tf_op_layer_Squeeze[0][0]                  
________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)               (None, 100, 130)            0              embedding[1][0]                            
                                                                                     tf_op_layer_Squeeze_1[0][0]                
________________________________________________________________________________________________________________________________
CHighway0 (TimeDistributed)               (None, 100, 130)            34060          concatenate_2[0][0]                        
________________________________________________________________________________________________________________________________
QHighway0 (TimeDistributed)               (None, 100, 130)            34060          concatenate_3[0][0]                        
________________________________________________________________________________________________________________________________
CHighway1 (TimeDistributed)               (None, 100, 130)            34060          CHighway0[0][0]                            
________________________________________________________________________________________________________________________________
QHighway1 (TimeDistributed)               (None, 100, 130)            34060          QHighway0[0][0]                            
________________________________________________________________________________________________________________________________
BiRNNEncoder (Bidirectional)              (None, 100, 200)            184800         CHighway1[0][0]                            
                                                                                     QHighway1[0][0]                            
________________________________________________________________________________________________________________________________
SimilarityLayer (Similarity)              (None, 100, 100)            601            BiRNNEncoder[0][0]                         
                                                                                     BiRNNEncoder[1][0]                         
________________________________________________________________________________________________________________________________
C2QAttention (C2QAttention)               (None, 100, 200)            0              SimilarityLayer[0][0]                      
                                                                                     BiRNNEncoder[1][0]                         
________________________________________________________________________________________________________________________________
Q2CAttention (Q2CAttention)               (None, 100, 200)            0              SimilarityLayer[0][0]                      
                                                                                     BiRNNEncoder[0][0]                         
________________________________________________________________________________________________________________________________
MergedContext (MergedContext)             (None, 100, 800)            0              BiRNNEncoder[0][0]                         
                                                                                     C2QAttention[0][0]                         
                                                                                     Q2CAttention[0][0]                         
________________________________________________________________________________________________________________________________
BiRNNDecoder1 (Bidirectional)             (None, 100, 200)            720800         MergedContext[0][0]                        
________________________________________________________________________________________________________________________________
SpanBegin (SpanBegin)                     (None, 100)                 1001           MergedContext[0][0]                        
                                                                                     BiRNNDecoder1[0][0]                        
________________________________________________________________________________________________________________________________
SpanEnd (SpanEnd)                         (None, 100)                 1201801        BiRNNEncoder[0][0]                         
                                                                                     MergedContext[0][0]                        
                                                                                     BiRNNDecoder1[0][0]                        
                                                                                     SpanBegin[0][0]                            
________________________________________________________________________________________________________________________________
CombineOutputs (Combine)                  (None, 2, 100)              0              SpanBegin[0][0]                            
                                                                                     SpanEnd[0][0]                              
================================================================================================================================
Total params: 14,563,883
Trainable params: 14,563,883
Non-trainable params: 0
________________________________________________________________________________________________________________________________
Epoch 1/10
1369/1369 [==============================] - 348s 254ms/step - loss: 1.0677 - accuracy: 0.7978 - val_loss: 0.0636 - val_accuracy: 0.9806
Epoch 2/10
1369/1369 [==============================] - 341s 249ms/step - loss: 0.0528 - accuracy: 0.9868 - val_loss: 0.0472 - val_accuracy: 0.9904
Epoch 3/10
1369/1369 [==============================] - 336s 246ms/step - loss: 0.0454 - accuracy: 0.9909 - val_loss: 0.0435 - val_accuracy: 0.9915
Epoch 4/10
1369/1369 [==============================] - 339s 248ms/step - loss: 0.0432 - accuracy: 0.9918 - val_loss: 0.0426 - val_accuracy: 0.9928
Epoch 5/10
1369/1369 [==============================] - 341s 249ms/step - loss: 0.0421 - accuracy: 0.9922 - val_loss: 0.0415 - val_accuracy: 0.9931
Epoch 6/10
1369/1369 [==============================] - 339s 248ms/step - loss: 0.0412 - accuracy: 0.9924 - val_loss: 0.0404 - val_accuracy: 0.9926
Epoch 7/10
1369/1369 [==============================] - 337s 246ms/step - loss: 0.0404 - accuracy: 0.9925 - val_loss: 0.0400 - val_accuracy: 0.9933
Epoch 8/10
1369/1369 [==============================] - 338s 247ms/step - loss: 0.0399 - accuracy: 0.9926 - val_loss: 0.0390 - val_accuracy: 0.9922
Epoch 9/10
1369/1369 [==============================] - 337s 246ms/step - loss: 0.0392 - accuracy: 0.9926 - val_loss: 0.0388 - val_accuracy: 0.9935
Epoch 10/10
1369/1369 [==============================] - 339s 247ms/step - loss: 0.0386 - accuracy: 0.9927 - val_loss: 0.0383 - val_accuracy: 0.9936